package practice;

public class HW_7_8 {


    /*
    1. Напишите алгоритм проверки числа на четность. Если число четное, удвойте это число.
    Напишите тест, который валидирует (проверяет правильность работы) ваш код. Выведите результат проверки чисел 2, 5, 14, 67, 0 на печать.
    */
    //private static

    /*
    2. Напишите алгоритм проверки возраста на соответствие условиям:
    Голосовать можно с 18 лет
    Машину можно водить с 16 лет
    В школу можно идти с 5 лет
    Напишите тест, который валидирует ваш код. Придумайте тестовые данные. Выведите результат проверки на печать.

    3. Напишите алгоритм программы, которая проверяет оценку ученика и выполняет следующие действия:
        5 - выдать похвальную грамоту и перевести в следующий класс
        4 - перевести в следующий класс
        3 - дать задание на лето и перевести в следующий класс
        2 - вызвать родителей и оставить в текущем классе на второй год
        Напишите тест, который валидирует ваш код.
        Выведите результат проверки на печать.

     4.Напишите алгоритм программы, которая проверяет число типа int на количество разрядов, и выводит результат проверки.
     ( Например, “It’s a two-digit number.”, “It’s a five-digit number.”, etc)
     Напишите тест, который валидирует ваш код.
     Выведите результат проверки на печать.

    5. Напишите алгоритм программы, которая складывает числа, которые делятся на 3 без остатка, и вычитает числа, которые делятся на 5 без остатка.*/


}
